Revit 2027 API
Form.PathCurveCount Property
The number of curves in the form path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int PathCurveCount { get; }
Public ReadOnly Property PathCurveCount As Integer
	Get
public:
property int PathCurveCount {
	int get ();
}
member PathCurveCount : int with get
Property Value
Int32
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace